# Cole Weber
# Week 13 = 4/21/2021
# Pyhton - Data Frame Processing

In [2]:
import numpy as np

import pandas as pd
from pandas import Series, DataFrame

In [19]:
df = DataFrame(np.arange(1, 17).reshape((4,4)), index = ['Ohio', 'Arizona', 'Nevada', 'Virginia'], 
               columns = ['one', 'two', 'three', 'four'])

In [20]:
df

          one  two  three  four
Ohio        1    2      3     4
Arizona     5    6      7     8
Nevada      9   10     11    12
Virginia   13   14     15    16

In [21]:
df.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [22]:
df.drop(['Arizona'])

          one  two  three  four
Ohio        1    2      3     4
Nevada      9   10     11    12
Virginia   13   14     15    16

In [23]:
df.drop(['one', 'three'], axis = 1)

          two  four
Ohio        2     4
Arizona     6     8
Nevada     10    12
Virginia   14    16

In [24]:
df.drop(['two'], inplace =True, axis=1)
df

          one  three  four
Ohio        1      3     4
Arizona     5      7     8
Nevada      9     11    12
Virginia   13     15    16

In [34]:
df

          one  three  four
Ohio        1      3     4
Arizona     5      7     8
Nevada      9     11    12
Virginia   13     15    16

In [29]:
df[df['three']>5]

          one  three  four
Arizona     5      7     8
Nevada      9     11    12
Virginia   13     15    16

In [35]:
df>5

            one  three   four
Ohio      False  False  False
Arizona   False   True   True
Nevada     True   True   True
Virginia   True   True   True

In [38]:
df[df<5] = 0
df

          one  three  four
Ohio        0      0     0
Arizona     5      7     8
Nevada      9     11    12
Virginia   13     15    16

In [41]:
# select entries with location and iloc
df.loc['Arizona', ['one', 'four']]

one     5
four    8
Name: Arizona, dtype: int32

In [43]:
df.iloc[2, [1, 2]]

three    11
four     12
Name: Nevada, dtype: int32

In [48]:
#Arithmetic and Data Alignment
df1 = DataFrame(np.arange(1,10).reshape((3,3)), columns =list('bcd'), index = ['Ohio', 'Arizona', 'Nevada'])
df2 = DataFrame(np.arange(1,13).reshape((4,3)), columns =list('bce'), index = ['Utah', 'Arizona', 'Nevada', 'Virginia'])
df1

         b  c  d
Ohio     1  2  3
Arizona  4  5  6
Nevada   7  8  9

In [49]:
df2

           b   c   e
Utah       1   2   3
Arizona    4   5   6
Nevada     7   8   9
Virginia  10  11  12

In [50]:
df1 + df2

             b     c   d   e
Arizona    8.0  10.0 NaN NaN
Nevada    14.0  16.0 NaN NaN
Ohio       NaN   NaN NaN NaN
Utah       NaN   NaN NaN NaN
Virginia   NaN   NaN NaN NaN

In [51]:
df1.add(df2, fill_value=0)

             b     c    d     e
Arizona    8.0  10.0  6.0   6.0
Nevada    14.0  16.0  9.0   9.0
Ohio       1.0   2.0  3.0   NaN
Utah       1.0   2.0  NaN   3.0
Virginia  10.0  11.0  NaN  12.0

In [58]:
df1['e'] = df1['b'] + df1['c']

In [60]:
df1.add(df2, fill_value=0)

             b     c     d     e
Arizona    8.0  10.0   9.0  15.0
Nevada    14.0  16.0  15.0  24.0
Ohio       1.0   2.0   3.0   3.0
Utah       1.0   2.0   NaN   3.0
Virginia  10.0  11.0   NaN  12.0

In [61]:
#Operation between DataFrame and Series
df2

           b   c   e
Utah       1   2   3
Arizona    4   5   6
Nevada     7   8   9
Virginia  10  11  12

In [63]:
s = df2.iloc[0]
s

b    1
c    2
e    3
Name: Utah, dtype: int32

In [64]:
# Series subtraction applied to all rows iteratively
df2 - s

          b  c  e
Utah      0  0  0
Arizona   3  3  3
Nevada    6  6  6
Virginia  9  9  9

In [65]:
# Sorting and Ranking DataFrame
df3 = DataFrame(np.arange(1, 13).reshape((3, 4)), columns = list('abcd'), index = ['One', 'Two', 'Three'])

In [66]:
df3

       a   b   c   d
One    1   2   3   4
Two    5   6   7   8
Three  9  10  11  12

In [71]:
df3.sort_index(axis=1, ascending=False)

        d   c   b  a
One     4   3   2  1
Two     8   7   6  5
Three  12  11  10  9

In [73]:
df4 = DataFrame({'b':[1.2, 3.4, 2.2] , 'c':[3, 5, 6]})
df4

     b  c
0  1.2  3
1  3.4  5
2  2.2  6

In [74]:
df4.sort_values(by=['b','c'])

     b  c
0  1.2  3
2  2.2  6
1  3.4  5

In [75]:
df4.rank()

     b    c
0  1.0  1.0
1  3.0  2.0
2  2.0  3.0

In [80]:
df_null = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
                   index = list('abcd'), columns = ['one', 'two'])
df_null

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [83]:
df_null.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [86]:
df_null.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [89]:
df_null.min(axis=1)

a    1.4
b   -4.5
c    NaN
d   -1.3
dtype: float64

In [94]:
df_null.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [100]:
#missing data
df = DataFrame([[1,2,3,4], [np.nan, 5.6, np.nan, np.nan], [7, np.nan, np.nan, 9], [np.nan, np.nan, np.nan np.nan]])
df

SyntaxError: invalid syntax (<ipython-input-100-2d3fa5870621>, line 2)

In [101]:
clean_df = df.dropna()
clean_df

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [103]:
df.dropna(how='all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  NaN  9.0

In [112]:
df.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  4.0
2  7.0  NaN  NaN  9.0

In [113]:
df.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.6  0.0  0.0
2  7.0  0.0  0.0  9.0

In [114]:
df.fillna(9, inplace=True)

In [115]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  9.0  5.6  9.0  9.0
2  7.0  9.0  9.0  9.0

In [122]:
# value counts
df = DataFrame({'Q1':[2, 3, 2, 2, 4], 
                'Q2':[2, 1, 1, 3, 5], 
                'Q3':[1, 5, 2, 4, 5]}, index = list('abcde'))
df

   Q1  Q2  Q3
a   2   2   1
b   3   1   5
c   2   1   2
d   2   3   4
e   4   5   5

In [123]:
df["Q1"].value_counts()

2    3
4    1
3    1
Name: Q1, dtype: int64

In [124]:
rs = df.apply(pd.value_counts)

In [127]:
rs.fillna(0, inplace=True)
rs

    Q1   Q2   Q3
1  0.0  2.0  1.0
2  3.0  1.0  1.0
3  1.0  1.0  0.0
4  1.0  0.0  1.0
5  0.0  1.0  2.0

In [130]:
rs.index_name='values'
rs

    Q1   Q2   Q3
1  0.0  2.0  1.0
2  3.0  1.0  1.0
3  1.0  1.0  0.0
4  1.0  0.0  1.0
5  0.0  1.0  2.0